RIOT-OS/RIOT/cpu/cc2538/include/vendor/hw_usb.h
/******************************************************************************
*  Filename:       hw_usb.h
*  Revised:        $Date: 2013-04-30 17:13:44 +0200 (Tue, 30 Apr 2013) $
*  Revision:       $Revision: 9943 $
*
*  Copyright (C) 2013 Texas Instruments Incorporated - http://www.ti.com/
*
*
*  Redistribution and use in source and binary forms, with or without
*  modification, are permitted provided that the following conditions
*  are met:
*
*    Redistributions of source code must retain the above copyright
*    notice, this list of conditions and the following disclaimer.
*
*    Redistributions in binary form must reproduce the above copyright
*    notice, this list of conditions and the following disclaimer in the
*    documentation and/or other materials provided with the distribution.
*
*    Neither the name of Texas Instruments Incorporated nor the names of
*    its contributors may be used to endorse or promote products derived
*    from this software without specific prior written permission.
*
*  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
*  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
*  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
*  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
*  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
*  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
*  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
*  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
*  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
*  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
*  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*
******************************************************************************/

#ifndef __HW_USB_H__
#define __HW_USB_H__

//*****************************************************************************
//
// The following are defines for the USB register offsets.
//
//*****************************************************************************
#define USB_ADDR                0x40089000  // Function address 
#define USB_POW                 0x40089004  // Power management and control 
                                            // register 
#define USB_IIF                 0x40089008  // Interrupt flags for endpoint 0 
                                            // and IN endpoints 1-5 
#define USB_OIF                 0x40089010  // Interrupt flags for OUT 
                                            // endpoints 1-5 
#define USB_CIF                 0x40089018  // Common USB interrupt flags 
#define USB_IIE                 0x4008901C  // Interrupt enable mask for IN 
                                            // endpoints 1-5 and endpoint 0 
#define USB_OIE                 0x40089024  // Interrupt enable mask for OUT 
                                            // endpoints 1-5 
#define USB_CIE                 0x4008902C  // Common USB interrupt enable 
                                            // mask 
#define USB_FRML                0x40089030  // Frame number (low byte) 
#define USB_FRMH                0x40089034  // Frame number (high byte) 
#define USB_INDEX               0x40089038  // Index register for selecting 
                                            // the endpoint status and control 
                                            // registers 
#define USB_CTRL                0x4008903C  // USB peripheral control register 
#define USB_MAXI                0x40089040  // Indexed register: For USB_INDEX 
                                            // = 1-5: Maximum packet size for 
                                            // IN endpoint {1-5} 
#define USB_CS0_CSIL            0x40089044  // Indexed register: For USB_INDEX 
                                            // = 0: Endpoint 0 control and 
                                            // status For USB_INDEX = 1-5: IN 
                                            // endpoint {1-5} control and 
                                            // status (low byte) 
#define USB_CSIH                0x40089048  // Indexed register: For USB_INDEX 
                                            // = 1-5: IN endpoint {1-5} control 
                                            // and status (high byte) 
#define USB_MAXO                0x4008904C  // Indexed register: For USB_INDEX 
                                            // = 1-5: Maximum packet size for 
                                            // OUT endpoint {1-5} 
#define USB_CSOL                0x40089050  // Indexed register: For USB_INDEX 
                                            // = 1-5: OUT endpoint {1-5} 
                                            // control and status (low byte) 
#define USB_CSOH                0x40089054  // Indexed register: For USB_INDEX 
                                            // = 1-5: OUT endpoint {1-5} 
                                            // control and status (high byte) 
#define USB_CNT0_CNTL           0x40089058  // Indexed register: For USB_INDEX 
                                            // = 0: Number of received bytes in 
                                            // the endpoint 0 FIFO For 
                                            // USB_INDEX = 1-5: Number of 
                                            // received bytes in the OUT 
                                            // endpoint {1-5} FIFO (low byte) 
#define USB_CNTH                0x4008905C  // Indexed register: For USB_INDEX 
                                            // = 1-5: Number of received in the 
                                            // OUT endpoint {1-5} FIFO (high 
                                            // byte) 
#define USB_F0                  0x40089080  // Endpoint 0 FIFO 
#define USB_F1                  0x40089088  // IN/OUT endpoint 1 FIFO 
#define USB_F2                  0x40089090  // IN/OUT endpoint 2 FIFO 
#define USB_F3                  0x40089098  // IN/OUT endpoint 3 FIFO 
#define USB_F4                  0x400890A0  // IN/OUT endpoint 4 FIFO 
#define USB_F5                  0x400890A8  // IN/OUT endpoint 5 FIFO 


