RIOT-OS/RIOT/cpu/cc2538/include/vendor/hw_usb.h
//*****************************************************************************
//
// The following are defines for the bit fields in the USB_ADDR register.
//
//*****************************************************************************
#define USB_ADDR_UPDATE         0x00000080  // This bit is set by hardware 
                                            // when writing to this register, 
                                            // and is cleared by hardware when 
                                            // the new address becomes 
                                            // effective. 
#define USB_ADDR_UPDATE_M       0x00000080
#define USB_ADDR_UPDATE_S       7
#define USB_ADDR_USBADDR_M      0x0000007F  // Device address. The address 
                                            // shall be updated upon successful 
                                            // completion of the status stage 
                                            // of the SET_ADDRESS request. 
#define USB_ADDR_USBADDR_S      0
//*****************************************************************************
//
// The following are defines for the bit fields in the USB_POW register.
//
//*****************************************************************************
#define USB_POW_ISOWAITSOF      0x00000080  // For isochronous mode IN 
                                            // endpoints: When set, the USB 
                                            // controller will wait for an SOF 
                                            // token from the time 
                                            // USB_CSIL.INPKTRDY is set before 
                                            // sending the packet. If an IN 
                                            // token is received before an SOF 
                                            // token, then a zero length data 
                                            // packet will be sent. 
#define USB_POW_ISOWAITSOF_M    0x00000080
#define USB_POW_ISOWAITSOF_S    7
#define USB_POW_RST             0x00000008  // Indicates that reset signaling 
                                            // is present on the bus 
#define USB_POW_RST_M           0x00000008
#define USB_POW_RST_S           3
#define USB_POW_RESUME          0x00000004  // Drives resume signaling for 
                                            // remote wakeup According to the 
                                            // USB Specification, the resume 
                                            // signal must be held active for 
                                            // at least 1 ms and no more than 
                                            // 15 ms. It is recommended to keep 
                                            // this bit set for approximately 
                                            // 10 ms. 
#define USB_POW_RESUME_M        0x00000004
#define USB_POW_RESUME_S        2
#define USB_POW_SUSPEND         0x00000002  // Indicates entry into suspend 
                                            // mode Suspend mode must be 
                                            // enabled by setting 
                                            // USB_POW.SUSPENDEN Software 
                                            // clears this bit by reading the 
                                            // USB_CIF register or by asserting 
                                            // USB_POW.RESUME 
#define USB_POW_SUSPEND_M       0x00000002
#define USB_POW_SUSPEND_S       1
#define USB_POW_SUSPENDEN       0x00000001  // Enables detection of and entry 
                                            // into suspend mode. 
#define USB_POW_SUSPENDEN_M     0x00000001
#define USB_POW_SUSPENDEN_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the USB_IIF register.
//
//*****************************************************************************
#define USB_IIF_INEP5IF         0x00000020  // Interrupt flag for IN endpoint 
                                            // 5 Cleared by hardware when read 
#define USB_IIF_INEP5IF_M       0x00000020
#define USB_IIF_INEP5IF_S       5
#define USB_IIF_INEP4IF         0x00000010  // Interrupt flag for IN endpoint 
                                            // 4 Cleared by hardware when read 
#define USB_IIF_INEP4IF_M       0x00000010
#define USB_IIF_INEP4IF_S       4
#define USB_IIF_INEP3IF         0x00000008  // Interrupt flag for IN endpoint 
                                            // 3 Cleared by hardware when read 
#define USB_IIF_INEP3IF_M       0x00000008
#define USB_IIF_INEP3IF_S       3
#define USB_IIF_INEP2IF         0x00000004  // Interrupt flag for IN endpoint 
                                            // 2 Cleared by hardware when read 
#define USB_IIF_INEP2IF_M       0x00000004
#define USB_IIF_INEP2IF_S       2
#define USB_IIF_INEP1IF         0x00000002  // Interrupt flag for IN endpoint 
                                            // 1 Cleared by hardware when read 
#define USB_IIF_INEP1IF_M       0x00000002
#define USB_IIF_INEP1IF_S       1
#define USB_IIF_EP0IF           0x00000001  // Interrupt flag for endpoint 0 
                                            // Cleared by hardware when read 
#define USB_IIF_EP0IF_M         0x00000001
#define USB_IIF_EP0IF_S         0
//*****************************************************************************
//
// The following are defines for the bit fields in the USB_OIF register.
//
//*****************************************************************************
#define USB_OIF_OUTEP5IF        0x00000020  // Interrupt flag for OUT endpoint 
                                            // 5 Cleared by hardware when read 
#define USB_OIF_OUTEP5IF_M      0x00000020
#define USB_OIF_OUTEP5IF_S      5
#define USB_OIF_OUTEP4IF        0x00000010  // Interrupt flag for OUT endpoint 
                                            // 4 Cleared by hardware when read 
#define USB_OIF_OUTEP4IF_M      0x00000010
#define USB_OIF_OUTEP4IF_S      4
#define USB_OIF_OUTEP3IF        0x00000008  // Interrupt flag for OUT endpoint 
                                            // 3 Cleared by hardware when read 
#define USB_OIF_OUTEP3IF_M      0x00000008
#define USB_OIF_OUTEP3IF_S      3
#define USB_OIF_OUTEP2IF        0x00000004  // Interrupt flag for OUT endpoint 
                                            // 2 Cleared by hardware when read 
#define USB_OIF_OUTEP2IF_M      0x00000004
#define USB_OIF_OUTEP2IF_S      2
#define USB_OIF_OUTEP1IF        0x00000002  // Interrupt flag for OUT endpoint 
                                            // 1 Cleared by hardware when read 
#define USB_OIF_OUTEP1IF_M      0x00000002
#define USB_OIF_OUTEP1IF_S      1
//*****************************************************************************
//
// The following are defines for the bit fields in the USB_CIF register.
//
//*****************************************************************************
#define USB_CIF_SOFIF           0x00000008  // Start-of-frame interrupt flag 
                                            // Cleared by hardware when read 
#define USB_CIF_SOFIF_M         0x00000008
#define USB_CIF_SOFIF_S         3
#define USB_CIF_RSTIF           0x00000004  // Reset interrupt flag Cleared by 
                                            // hardware when read 
#define USB_CIF_RSTIF_M         0x00000004
#define USB_CIF_RSTIF_S         2
#define USB_CIF_RESUMEIF        0x00000002  // Resume interrupt flag Cleared 
                                            // by hardware when read 
#define USB_CIF_RESUMEIF_M      0x00000002
#define USB_CIF_RESUMEIF_S      1
#define USB_CIF_SUSPENDIF       0x00000001  // Suspend interrupt flag Cleared 
                                            // by hardware when read 
#define USB_CIF_SUSPENDIF_M     0x00000001
#define USB_CIF_SUSPENDIF_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the USB_IIE register.
//
//*****************************************************************************
#define USB_IIE_INEP5IE         0x00000020  // Interrupt enable for IN 
                                            // endpoint 5 0: Interrupt disabled 
                                            // 1: Interrupt enabled 
#define USB_IIE_INEP5IE_M       0x00000020
#define USB_IIE_INEP5IE_S       5
#define USB_IIE_INEP4IE         0x00000010  // Interrupt enable for IN 
                                            // endpoint 4 0: Interrupt disabled 
                                            // 1: Interrupt enabled 
#define USB_IIE_INEP4IE_M       0x00000010
#define USB_IIE_INEP4IE_S       4
#define USB_IIE_INEP3IE         0x00000008  // Interrupt enable for IN 
                                            // endpoint 3 0: Interrupt disabled 
                                            // 1: Interrupt enabled 
#define USB_IIE_INEP3IE_M       0x00000008
#define USB_IIE_INEP3IE_S       3
#define USB_IIE_INEP2IE         0x00000004  // Interrupt enable for IN 
                                            // endpoint 2 0: Interrupt disabled 
                                            // 1: Interrupt enabled 
#define USB_IIE_INEP2IE_M       0x00000004
#define USB_IIE_INEP2IE_S       2
#define USB_IIE_INEP1IE         0x00000002  // Interrupt enable for IN 
                                            // endpoint 1 0: Interrupt disabled 
                                            // 1: Interrupt enabled 
#define USB_IIE_INEP1IE_M       0x00000002
#define USB_IIE_INEP1IE_S       1
#define USB_IIE_EP0IE           0x00000001  // Interrupt enable for endpoint 0 
                                            // 0: Interrupt disabled 1: 
                                            // Interrupt enabled 
#define USB_IIE_EP0IE_M         0x00000001
#define USB_IIE_EP0IE_S         0
//*****************************************************************************
//
// The following are defines for the bit fields in the USB_OIE register.
//
//*****************************************************************************
#define USB_OIE_reserved8_M     0x000000C0  // Reserved 
#define USB_OIE_reserved8_S     6
#define USB_OIE_OUTEP5IE        0x00000020  // Interrupt enable for OUT 
                                            // endpoint 5 0: Interrupt disabled 
                                            // 1: Interrupt enabled 
#define USB_OIE_OUTEP5IE_M      0x00000020
#define USB_OIE_OUTEP5IE_S      5
#define USB_OIE_OUTEP4IE        0x00000010  // Interrupt enable for OUT 
                                            // endpoint 4 0: Interrupt disabled 
                                            // 1: Interrupt enabled 
#define USB_OIE_OUTEP4IE_M      0x00000010
#define USB_OIE_OUTEP4IE_S      4
#define USB_OIE_OUTEP3IE        0x00000008  // Interrupt enable for OUT 
                                            // endpoint 3 0: Interrupt disabled 
                                            // 1: Interrupt enabled 
#define USB_OIE_OUTEP3IE_M      0x00000008
#define USB_OIE_OUTEP3IE_S      3
#define USB_OIE_OUTEP2IE        0x00000004  // Interrupt enable for OUT 
                                            // endpoint 2 0: Interrupt disabled 
                                            // 1: Interrupt enabled 
#define USB_OIE_OUTEP2IE_M      0x00000004
#define USB_OIE_OUTEP2IE_S      2
#define USB_OIE_OUTEP1IE        0x00000002  // Interrupt enable for OUT 
                                            // endpoint 1 0: Interrupt disabled 
                                            // 1: Interrupt enabled 
#define USB_OIE_OUTEP1IE_M      0x00000002
#define USB_OIE_OUTEP1IE_S      1
//*****************************************************************************
//
// The following are defines for the bit fields in the USB_CIE register.
//
//*****************************************************************************
#define USB_CIE_SOFIE           0x00000008  // Start-of-frame interrupt enable 
                                            // 0: Interrupt disabled 1: 
                                            // Interrupt enabled 
#define USB_CIE_SOFIE_M         0x00000008
#define USB_CIE_SOFIE_S         3
#define USB_CIE_RSTIE           0x00000004  // Reset interrupt enable 0: 
                                            // Interrupt disabled 1: Interrupt 
                                            // enabled 
#define USB_CIE_RSTIE_M         0x00000004
#define USB_CIE_RSTIE_S         2
#define USB_CIE_RESUMEIE        0x00000002  // Resume interrupt enable 0: 
                                            // Interrupt disabled 1: Interrupt 
                                            // enabled 
#define USB_CIE_RESUMEIE_M      0x00000002
#define USB_CIE_RESUMEIE_S      1
#define USB_CIE_SUSPENDIE       0x00000001  // Suspend interrupt enable 0: 
                                            // Interrupt disabled 1: Interrupt 
                                            // enabled 
#define USB_CIE_SUSPENDIE_M     0x00000001
#define USB_CIE_SUSPENDIE_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the USB_FRML register.
//
//*****************************************************************************
#define USB_FRML_FRAMEL_M       0x000000FF  // Bits 7:0 of the 11-bit frame 
                                            // number The frame number is only 
                                            // updated upon successful 
                                            // reception of SOF tokens 
#define USB_FRML_FRAMEL_S       0
//*****************************************************************************
//
// The following are defines for the bit fields in the USB_FRMH register.
//
//*****************************************************************************
#define USB_FRMH_FRAMEH_M       0x00000007  // Bits 10:8 of the 11-bit frame 
                                            // number The frame number is only 
                                            // updated upon successful 
                                            // reception of SOF tokens 
#define USB_FRMH_FRAMEH_S       0
//*****************************************************************************
//
// The following are defines for the bit fields in the USB_INDEX register.
//
//*****************************************************************************
#define USB_INDEX_USBINDEX_M    0x0000000F  // Index of the currently selected 
                                            // endpoint The index is set to 0 
                                            // to enable access to endpoint 0 
                                            // control and status registers The 
                                            // index is set to 1, 2, 3, 4 or 5 
                                            // to enable access to IN/OUT 
                                            // endpoint 1, 2, 3, 4 or 5 control 
                                            // and status registers, 
                                            // respectively 
#define USB_INDEX_USBINDEX_S    0
//*****************************************************************************
//
// The following are defines for the bit fields in the USB_CTRL register.
//
//*****************************************************************************
#define USB_CTRL_PLLLOCKED      0x00000080  // PLL lock status. The PLL is 
                                            // locked when USB_CTRL.PLLLOCKED 
                                            // is 1. 
#define USB_CTRL_PLLLOCKED_M    0x00000080
#define USB_CTRL_PLLLOCKED_S    7
#define USB_CTRL_PLLEN          0x00000002  // 48 MHz USB PLL enable When this 
                                            // bit is set, the 48 MHz PLL is 
                                            // started. Software must avoid 
                                            // access to other USB registers 
                                            // before the PLL has locked; that 
                                            // is, USB_CTRL.PLLLOCKED is 1. 
                                            // This bit can be set only when 
                                            // USB_CTRL.USBEN is 1. The PLL 
                                            // must be disabled before entering 
                                            // PM1 when suspended, and must be 
                                            // re-enabled when resuming 
                                            // operation. 
#define USB_CTRL_PLLEN_M        0x00000002
#define USB_CTRL_PLLEN_S        1
#define USB_CTRL_USBEN          0x00000001  // USB enable The USB controller 
                                            // is reset when this bit is 
                                            // cleared 
#define USB_CTRL_USBEN_M        0x00000001
#define USB_CTRL_USBEN_S        0
//*****************************************************************************
//
// The following are defines for the bit fields in the USB_MAXI register.
//
//*****************************************************************************
#define USB_MAXI_USBMAXI_M      0x000000FF  // Maximum packet size, in units 
                                            // of 8 bytes, for the selected IN 
                                            // endpoint The value of this 
                                            // register should match the 
                                            // wMaxPacketSize field in the 
                                            // standard endpoint descriptor for 
                                            // the endpoint. The value must not 
                                            // exceed the available memory. 
#define USB_MAXI_USBMAXI_S      0
//*****************************************************************************
//
// The following are defines for the bit fields in the USB_CS0_CSIL register.
//
//*****************************************************************************
#define USB_CS0_CSIL_CLROUTPKTRDY_or_CLRDATATOG \
                                0x00000040  // USB_CS0.CLROUTPKTRDY [RW]: 
                                            // Software sets this bit to clear 
                                            // the USB_CS0.OUTPKTRDY bit. It is 
                                            // cleared automatically. 
                                            // USB_CSIL.CLRDATATOG [RW]: 
                                            // Software sets this bit to reset 
                                            // the IN endpoint data toggle to 
                                            // 0. 

#define USB_CS0_CSIL_CLROUTPKTRDY_or_CLRDATATOG_M \
                                0x00000040
#define USB_CS0_CSIL_CLROUTPKTRDY_or_CLRDATATOG_S 6
#define USB_CS0_CSIL_SENDSTALL_or_SENTSTALL \
                                0x00000020  // USB_CS0.SENDSTALL [RW]: 
                                            // Software sets this bit to 
                                            // terminate the current 
                                            // transaction with a STALL 
                                            // handshake. The bit is cleared 
                                            // automatically when the STALL 
                                            // handshake has been transmitted. 
                                            // USB_CSIL.SENTSTALL [RW]: For 
                                            // bulk/interrupt mode IN 
                                            // endpoints: This bit is set when 
                                            // a STALL handshake is 
                                            // transmitted. The FIFO is flushed 
                                            // and the USB_CSIL.INPKTRDY bit 
                                            // cleared. Software should clear 
                                            // this bit. 

#define USB_CS0_CSIL_SENDSTALL_or_SENTSTALL_M \
                                0x00000020
#define USB_CS0_CSIL_SENDSTALL_or_SENTSTALL_S 5
#define USB_CS0_CSIL_SETUPEND_or_SENDSTALL \
                                0x00000010  // USB_CS0.SETUPEND [RO]: This bit 
                                            // is set when a control 
                                            // transaction ends before the 
                                            // USB_CS0.DATAEND bit has been 
                                            // set. An interrupt is generated 
                                            // and the FIFO flushed at this 
                                            // time. Software clears this bit 
                                            // by setting USB_CS0.CLRSETUPEND. 
                                            // CSIL.SENDSTALL [RW]: For 
                                            // bulk/interrupt mode IN 
                                            // endpoints: Software sets this 
                                            // bit to issue a STALL handshake. 
                                            // Software clears this bit to 
                                            // terminate the stall condition. 

#define USB_CS0_CSIL_SETUPEND_or_SENDSTALL_M \
                                0x00000010
#define USB_CS0_CSIL_SETUPEND_or_SENDSTALL_S 4
#define USB_CS0_CSIL_DATAEND_or_FLUSHPACKET \
                                0x00000008  // USB_CS0.DATAEND [RW]: This bit 
                                            // is used to signal the end of the 
                                            // data stage, and must be set: 1. 
                                            // When the last data packet is 
                                            // loaded and USB_CS0.INPKTRDY is 
                                            // set. 2. When the last data 
                                            // packet is unloaded and 
                                            // USB_CS0.CLROUTPKTRDY is set. 3. 
                                            // When USB_CS0.INPKTRDY is set to 
                                            // send a zero-length packet. The 
                                            // USB controller clears this bit 
                                            // automatically. 
                                            // USB_CSIL.FLUSHPACKET [RW]: 
                                            // Software sets this bit to flush 
                                            // the next packet to be 
                                            // transmitted from the IN endpoint 
                                            // FIFO. The FIFO pointer is reset 
                                            // and the USB_CSIL.INPKTRDY bit is 
                                            // cleared. Note: If the FIFO 
                                            // contains two packets, 
                                            // USB_CSIL.FLUSHPACKET will need 
                                            // to be set twice to completely 
                                            // clear the FIFO. 

