RIOT-OS/RIOT/cpu/cc2538/include/vendor/hw_usb.h
#define USB_CS0_CSIL_DATAEND_or_FLUSHPACKET_M \
                                0x00000008
#define USB_CS0_CSIL_DATAEND_or_FLUSHPACKET_S 3
#define USB_CS0_CSIL_SENTSTALL_or_UNDERRUN \
                                0x00000004  // USB_CS0.SENTSTALL [RW]: This 
                                            // bit is set when a STALL 
                                            // handshake is sent. An interrupt 
                                            // is generated is generated when 
                                            // this bit is set. Software must 
                                            // clear this bit. 
                                            // USB_CSIL.UNDERRUN [RW]: In 
                                            // isochronous mode, this bit is 
                                            // set when a zero length data 
                                            // packet is sent after receiving 
                                            // an IN token with 
                                            // USB_CSIL.INPKTRDY not set. In 
                                            // bulk/interrupt mode, this bit is 
                                            // set when a NAK is returned in 
                                            // response to an IN token. 
                                            // Software should clear this bit. 

#define USB_CS0_CSIL_SENTSTALL_or_UNDERRUN_M \
                                0x00000004
#define USB_CS0_CSIL_SENTSTALL_or_UNDERRUN_S 2
#define USB_CS0_CSIL_INPKTRDY_or_PKTPRESENT \
                                0x00000002  // USB_CS0. INPKTRDY [RW]: 
                                            // Software sets this bit after 
                                            // loading a data packet into the 
                                            // endpoint 0 FIFO. It is cleared 
                                            // automatically when the data 
                                            // packet has been transmitted. An 
                                            // interrupt is generated when the 
                                            // bit is cleared. 
                                            // USB_CSIL.PKTPRESENT [RO]: This 
                                            // bit is set when there is at 
                                            // least one packet in the IN 
                                            // endpoint FIFO. 

#define USB_CS0_CSIL_INPKTRDY_or_PKTPRESENT_M \
                                0x00000002
#define USB_CS0_CSIL_INPKTRDY_or_PKTPRESENT_S 1
#define USB_CS0_CSIL_OUTPKTRDY_or_INPKTRDY \
                                0x00000001  // USB_CS0.OUTPKTRDY [RO]: 
                                            // Endpoint 0 data packet received 
                                            // An interrupt request (EP0) is 
                                            // generated if the interrupt is 
                                            // enabled. Software must read the 
                                            // endpoint 0 FIFO empty, and clear 
                                            // this bit by setting 
                                            // USB_CS0.CLROUTPKTRDY 
                                            // USB_CSIL.INPKTRDY [RW]: IN 
                                            // endpoint {1-5} packet transfer 
                                            // pending Software sets this bit 
                                            // after loading a data packet into 
                                            // the FIFO. It is cleared 
                                            // automatically when a data packet 
                                            // has been transmitted. An 
                                            // interrupt is generated (if 
                                            // enabled) when the bit is 
                                            // cleared. When using 
                                            // double-buffering, the bit is 
                                            // cleared immediately if the other 
                                            // FIFO is empty. 

#define USB_CS0_CSIL_OUTPKTRDY_or_INPKTRDY_M \
                                0x00000001
#define USB_CS0_CSIL_OUTPKTRDY_or_INPKTRDY_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the USB_CSIH register.
//
//*****************************************************************************
#define USB_CSIH_AUTISET        0x00000080  // If set by software, the 
                                            // USB_CSIL.INPKTRDY bit is 
                                            // automatically set when a data 
                                            // packet of maximum size 
                                            // (specified by USBMAXI) is loaded 
                                            // into the IN endpoint FIFO. If a 
                                            // packet of less than the maximum 
                                            // packet size is loaded, then 
                                            // USB_CSIL.INPKTRDY will have to 
                                            // be set manually. 
#define USB_CSIH_AUTISET_M      0x00000080
#define USB_CSIH_AUTISET_S      7
#define USB_CSIH_ISO            0x00000040  // Selects IN endpoint type: 0: 
                                            // Bulk/interrupt 1: Isochronous 
#define USB_CSIH_ISO_M          0x00000040
#define USB_CSIH_ISO_S          6
#define USB_CSIH_FORCEDATATOG   0x00000008  // Software sets this bit to force 
                                            // the IN endpoint's data toggle to 
                                            // switch after each data packet is 
                                            // sent regardless of whether an 
                                            // ACK was received. This can be 
                                            // used by interrupt IN endpoints 
                                            // which are used to communicate 
                                            // rate feedback for isochronous 
                                            // endpoints. 
#define USB_CSIH_FORCEDATATOG_M 0x00000008
#define USB_CSIH_FORCEDATATOG_S 3
#define USB_CSIH_INDBLBUF       0x00000001  // IN endpoint FIFO 
                                            // double-buffering enable: 0: 
                                            // Double buffering disabled 1: 
                                            // Double buffering enabled 
#define USB_CSIH_INDBLBUF_M     0x00000001
#define USB_CSIH_INDBLBUF_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the USB_MAXO register.
//
//*****************************************************************************
#define USB_MAXO_USBMAXO_M      0x000000FF  // Maximum packet size, in units 
                                            // of 8 bytes, for the selected OUT 
                                            // endpoint The value of this 
                                            // register should match the 
                                            // wMaxPacketSize field in the 
                                            // standard endpoint descriptor for 
                                            // the endpoint. The value must not 
                                            // exceed the available memory. 
#define USB_MAXO_USBMAXO_S      0
//*****************************************************************************
//
// The following are defines for the bit fields in the USB_CSOL register.
//
//*****************************************************************************
#define USB_CSOL_CLRDATATOG     0x00000080  // Software sets this bit to reset 
                                            // the endpoint data toggle to 0. 
#define USB_CSOL_CLRDATATOG_M   0x00000080
#define USB_CSOL_CLRDATATOG_S   7
#define USB_CSOL_SENTSTALL      0x00000040  // This bit is set when a STALL 
                                            // handshake is transmitted. An 
                                            // interrupt is generated when this 
                                            // bit is set. Software should 
                                            // clear this bit. 
#define USB_CSOL_SENTSTALL_M    0x00000040
#define USB_CSOL_SENTSTALL_S    6
#define USB_CSOL_SENDSTALL      0x00000020  // For bulk/interrupt mode OUT 
                                            // endpoints: Software sets this 
                                            // bit to issue a STALL handshake. 
                                            // Software clears this bit to 
                                            // terminate the stall condition. 
#define USB_CSOL_SENDSTALL_M    0x00000020
#define USB_CSOL_SENDSTALL_S    5
#define USB_CSOL_FLUSHPACKET    0x00000010  // Software sets this bit to flush 
                                            // the next packet to be read from 
                                            // the endpoint OUT FIFO. Note: If 
                                            // the FIFO contains two packets, 
                                            // USB_CSOL.FLUSHPACKET will need 
                                            // to be set twice to completely 
                                            // clear the FIFO. 
#define USB_CSOL_FLUSHPACKET_M  0x00000010
#define USB_CSOL_FLUSHPACKET_S  4
#define USB_CSOL_DATAERROR      0x00000008  // For isochronous mode OUT 
                                            // endpoints: This bit is set when 
                                            // USB_CSOL.OUTPKTRDY is set if the 
                                            // data packet has a CRC or 
                                            // bit-stuff error. It is cleared 
                                            // automatically when 
                                            // USB_CSOL.OUTPKTRDY is cleared. 
#define USB_CSOL_DATAERROR_M    0x00000008
#define USB_CSOL_DATAERROR_S    3
#define USB_CSOL_OVERRUN        0x00000004  // For isochronous mode OUT 
                                            // endpoints: This bit is set when 
                                            // an OUT packet cannot be loaded 
                                            // into the OUT endpoint FIFO. 
                                            // Firmware should clear this bit. 
#define USB_CSOL_OVERRUN_M      0x00000004
#define USB_CSOL_OVERRUN_S      2
#define USB_CSOL_FIFOFULL       0x00000002  // This bit is set when no more 
                                            // packets can be loaded into the 
                                            // OUT endpoint FIFO. 
#define USB_CSOL_FIFOFULL_M     0x00000002
#define USB_CSOL_FIFOFULL_S     1
#define USB_CSOL_OUTPKTRDY      0x00000001  // This bit is set when a data 
                                            // packet has been received. 
                                            // Software should clear this bit 
                                            // when the packet has been 
                                            // unloaded from the OUT endpoint 
                                            // FIFO. An interrupt is generated 
                                            // when the bit is set. 
#define USB_CSOL_OUTPKTRDY_M    0x00000001
#define USB_CSOL_OUTPKTRDY_S    0
//*****************************************************************************
//
// The following are defines for the bit fields in the USB_CSOH register.
//
//*****************************************************************************
#define USB_CSOH_AUTOCLEAR      0x00000080  // If software sets this bit, the 
                                            // USB_CSOL.OUTPKTRDY bit will be 
                                            // automatically cleared when a 
                                            // packet of maximum size 
                                            // (specified by USB_MAXO) has been 
                                            // unloaded from the OUT FIFO. When 
                                            // packets of less than the maximum 
                                            // packet size are unloaded, 
                                            // USB_CSOL.OUTPKTRDY will have to 
                                            // be cleared manually. 
#define USB_CSOH_AUTOCLEAR_M    0x00000080
#define USB_CSOH_AUTOCLEAR_S    7
#define USB_CSOH_ISO            0x00000040  // Selects OUT endpoint type: 0: 
                                            // Bulk/interrupt 1: Isochronous 
#define USB_CSOH_ISO_M          0x00000040
#define USB_CSOH_ISO_S          6
#define USB_CSOH_OUTDBLBUF      0x00000001  // OUT endpoint FIFO 
                                            // double-buffering enable: 0: 
                                            // Double buffering disabled 1: 
                                            // Double buffering enabled 
#define USB_CSOH_OUTDBLBUF_M    0x00000001
#define USB_CSOH_OUTDBLBUF_S    0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// USB_CNT0_CNTL register.
//
//*****************************************************************************
#define USB_CNT0_CNTL_FIFOCNT_or_FIFOCNTL_M \
                                0x000000FF  // USB_CS0.FIFOCNT (USBINDEX = 0) 
                                            // [RO]: Number of bytes received 
                                            // in the packet in the endpoint 0 
                                            // FIFO Valid only when 
                                            // USB_CS0.OUTPKTRDY is set 
                                            // USB_CSIL.FIFOCNTL (USBINDEX = 1 
                                            // to 5) [RW]: Bits 7:0 of the of 
                                            // the number of bytes received in 
                                            // the packet in the OUT endpoint 
                                            // {1-5} FIFO Valid only when 
                                            // USB_CSOL.OUTPKTRDY is set 

#define USB_CNT0_CNTL_FIFOCNT_or_FIFOCNTL_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the USB_CNTH register.
//
//*****************************************************************************
#define USB_CNTH_FIFOCNTH_M     0x00000007  // Bits 10:8 of the of the number 
                                            // of bytes received in the packet 
                                            // in the OUT endpoint {1-5} FIFO 
                                            // Valid only when 
                                            // USB_CSOL.OUTPKTRDY is set 
#define USB_CNTH_FIFOCNTH_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the USB_F0 register.
//
//*****************************************************************************
#define USB_F0_USBF0_M          0x000000FF  // Endpoint 0 FIFO Reading this 
                                            // register unloads one byte from 
                                            // the endpoint 0 FIFO. Writing to 
                                            // this register loads one byte 
                                            // into the endpoint 0 FIFO. The 
                                            // FIFO memory for EP0 is used for 
                                            // incoming and outgoing data 
                                            // packets. 
#define USB_F0_USBF0_S          0
//*****************************************************************************
//
// The following are defines for the bit fields in the USB_F1 register.
//
//*****************************************************************************
#define USB_F1_USBF1_M          0x000000FF  // Endpoint 1 FIFO register 
                                            // Reading this register unloads 
                                            // one byte from the EP1 OUT FIFO. 
                                            // Writing to this register loads 
                                            // one byte into the EP1 IN FIFO. 
#define USB_F1_USBF1_S          0
//*****************************************************************************
//
// The following are defines for the bit fields in the USB_F2 register.
//
//*****************************************************************************
#define USB_F2_USBF2_M          0x000000FF  // Endpoint 2 FIFO register 
                                            // Reading this register unloads 
                                            // one byte from the EP2 OUT FIFO. 
                                            // Writing to this register loads 
                                            // one byte into the EP2 IN FIFO. 
#define USB_F2_USBF2_S          0
//*****************************************************************************
//
// The following are defines for the bit fields in the USB_F3 register.
//
//*****************************************************************************
#define USB_F3_USBF3_M          0x000000FF  // Endpoint 3 FIFO register 
                                            // Reading this register unloads 
                                            // one byte from the EP3 OUT FIFO. 
                                            // Writing to this register loads 
                                            // one byte into the EP3 IN FIFO. 
#define USB_F3_USBF3_S          0
//*****************************************************************************
//
// The following are defines for the bit fields in the USB_F4 register.
//
//*****************************************************************************
#define USB_F4_USBF4_M          0x000000FF  // Endpoint 4 FIFO register 
                                            // Reading this register unloads 
                                            // one byte from the EP4 OUT FIFO. 
                                            // Writing to this register loads 
                                            // one byte into the EP4 IN FIFO. 
#define USB_F4_USBF4_S          0
//*****************************************************************************
//
// The following are defines for the bit fields in the USB_F5 register.
//
//*****************************************************************************
#define USB_F5_USBF5_M          0x000000FF  // Endpoint 5 FIFO register 
                                            // Reading this register unloads 
                                            // one byte from the EP5 OUT FIFO. 
                                            // Writing to this register loads 
                                            // one byte into the EP5 IN FIFO. 
#define USB_F5_USBF5_S          0


#endif // __HW_USB_H__

